{
  "movies": [
    {id: 1,
      name: 'Rogue One: A Star Wars Story',
      info: 'Rogue One is set directly before Episode IV: A New Hope and focuses on the eponymous group of rebels who obtain the plans to the Death Star.[35] Its laser was developed by scientist Galen Erso (played by Mads Mikkelsen) after the Empire forcibly abducted him, separating him from his daughter Jyn. Galen secretly sends a defecting Imperial pilot, Bodhi Rook, to deliver a message warning of the weapon\'s existence and revealing its weakness to his rebel friend Saw Gerrera. Under the false promise of her father\'s liberation, Jyn agrees to help Rebel Alliance intelligence officer Cassian Andor and his droid K-2SO retrieve the message from Saw, now the paranoid leader of an extremist cell of rebels.',
      img: '../assets/images/films/1.jpg',
      releaseDate: 'December 10, 2016',
      director: 'Gareth Edwards',
      money: {
        budget: '$200–265 million',
        earned: '$1.058 billion'
      }
    },
    {id: 2,
      name: 'Star Wars: The Rise of Skywalker',
      info: 'Star Wars: The Rise of Skywalker (also known as Star Wars: Episode IX – The Rise of Skywalker) is a 2019 American epic space opera film produced, co-written, and directed by J. J. Abrams. Produced by Lucasfilm and Abrams\' production company Bad Robot Productions, and distributed by Walt Disney Studios Motion Pictures, it is the third installment of the Star Wars sequel trilogy, following The Force Awakens (2015) and The Last Jedi (2017), and the final episode of the nine-part "Skywalker saga".[a] Its ensemble cast includes Carrie Fisher,[b] Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong\'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, and Billy Dee Williams. The Rise of Skywalker follows Rey, Finn, and Poe Dameron as they lead the Resistance\'s final stand against Supreme Leader Kylo Ren and the First Order, who are aided by the return of the Galactic Emperor, Palpatine.',
      img: '../assets/images/films/2.jpg',
      releaseDate: 'December 16, 2019',
      director: 'J. J. Abrams',
      money: {
        budget: '$275 million',
        earned: '$1.074 billion'
      }
    }
  ]
}